from django.utils.translation import gettext_lazy as _

SEX_CHOICES = (
    ("SECRET", _("秘密")),
    ("MALE", _("男")),
    ("FEMAIL", _("女")),
)

STATUS_CHOICES = (
    ("NORMAL", _("正常")),
    ("CLOSE", _("关闭")),
    ("DRAF", _("草稿")),
)
WEEK_CHOICES = (
    ("DAY_1", _("星期一")),
    ("DAY_2", _("星期二")),
    ("DAY_3", _("星期三")),
    ("DAY_4", _("星期四")),
    ("DAY_5", _("星期五")),
    ("DAY_6", _("星期六")),
    ("DAY_7", _("星期天")),
)
TIME_CHOICES = (
    ("TIME_1", ("07:10~08:00")),
    ("TIME_2", ("08:10~09:00")),
    ("TIME_3", ("09:10~10:00")),
    ("TIME_4", ("10:20~11:10")),
    ("TIME_5", ("11:20~12:10")),
    ("TIME_6", ("12:20~13:10")),
    ("TIME_7", ("13:20~14:10")),
    ("TIME_8", ("14:20~15:10")),
    ("TIME_9", ("15:30~16:20")),
    ("TIME_10", ("16:30~17:20")),
    ("TIME_11", ("17:30~18:20")),
    ("TIME_12", ("18:25~19:15")),
    ("TIME_13", ("19:20~20:10")),
    ("TIME_14", ("20:15~21:05")),
    ("TIME_15", ("21:10~22:00")),
)

CREDIT_CHOICES = (
    ("DEFAULT", _("待定")),
    ("PASS", _("通过")),
    ("FAIL", _("重修")),
)
